app/Controllers/Admin/Appointments.php

    public function index()
    {
        $appointmentModel = new AppointmentModel();
        $appointments = $appointmentModel
            ->orderBy('date', 'DESC')
            ->findAll();

        $appointmentServiceModel = new AppointmentServiceModel();
        $serviceModel = new ServiceModel();
        $barberModel = new BarberModel();

        foreach($appointments as &$app){
            $barber = $barberModel->find($app['barber_id']);
            $app['barber_name'] = $barber ? $barber['name'] : 'N/A';

            $serviceLinks = $appointmentServiceModel
                ->where('appointment_id', $app['id'])
                ->findAll();

            $serviceNames = [];
            foreach($serviceLinks as $link){
                $service = $serviceModel->find($link['service_id']);
---
SELECT *
FROM `appointments`
ORDER BY `date` DESC
SELECT *
FROM `barbers`
WHERE `barbers`.`id` = '11'
SELECT *
FROM `appointment_services`
WHERE `appointment_id` = '29'
SELECT *
FROM `services`
WHERE `services`.`id` = '7'

    public function updateStatus($id)
    {
        $appointmentModel = new AppointmentModel();
        $appointment = $appointmentModel->find($id);

        if (!$appointment) {
            return redirect()->back()->with('error', 'Appointment not found');
        }

        $status = $this->request->getPost('status');
        if (!in_array($status, ['pending', 'confirmed', 'completed', 'cancelled'])) {
            return redirect()->back()->with('error', 'Invalid status');
        }

        $appointmentModel->update($id, ['status' => $status]);
---
SELECT *
FROM `appointments`
WHERE `appointments`.`id` = '30'
UPDATE `appointments` SET `status` = 'confirmed', `updated_at` = '2026-01-29 08:48:52'
WHERE `appointments`.`id` IN ('30')