app/Controllers/Admin/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `appointments`
SELECT COUNT(*) AS `numrows`
FROM `appointments`
WHERE `date` = '2026-01-29'
SELECT COUNT(*) AS `numrows`
FROM `barbers`
WHERE `status` = 'active'
SELECT SUM(`services`.`price`) AS `total`
FROM `appointment_services`
JOIN `services` ON `services`.`id` = `appointment_services`.`service_id`
JOIN `appointments` ON `appointments`.`id` = `appointment_services`.`appointment_id`
WHERE `appointments`.`status` = 'completed'
---
    public function index()
    {
        $appointmentModel = new AppointmentModel();
        $appointmentServiceModel = new AppointmentServiceModel();
        $barberModel = new BarberModel();

        // Total appointments
        $totalAppointments = $appointmentModel->countAllResults();

        // Today bookings
        $todayBookings = $appointmentModel
            ->where('date', date('Y-m-d'))
            ->countAllResults();

        // Active barbers
        $activeBarbers = $barberModel
            ->where('status', 'active')
            ->countAllResults();

        // Total revenue (completed appointments)
        $totalRevenue = $appointmentServiceModel
            ->selectSum('services.price', 'total')
            ->join('services', 'services.id = appointment_services.service_id')
            ->join('appointments', 'appointments.id = appointment_services.appointment_id')
            ->where('appointments.status', 'completed')
            ->get()
            ->getRow()
            ->total ?? 0;

SELECT COUNT(*) AS `numrows`
FROM `appointments`
WHERE `date` = '2026-01-23'
SELECT SUM(`services`.`price`) AS `total`
FROM `appointment_services`
JOIN `services` ON `services`.`id` = `appointment_services`.`service_id`
JOIN `appointments` ON `appointments`.`id` = `appointment_services`.`appointment_id`
WHERE `appointments`.`status` = 'completed'
AND `appointments`.`date` = '2026-01-23'
---

             $appointmentModel->resetQuery();

            $weeklyBookings[] = $appointmentModel
                ->where('date', $day)
                ->countAllResults();

                 $appointmentServiceModel->resetQuery();

            $dailyRevenue = $appointmentServiceModel
                ->selectSum('services.price', 'total')
                ->join('services', 'services.id = appointment_services.service_id')
                ->join('appointments', 'appointments.id = appointment_services.appointment_id')
                ->where('appointments.status', 'completed')
                ->where('appointments.date', $day)
                ->get()
                ->getRow()
                ->total ?? 0;