app/Controllers/Admin/Gallery.php

    public function view()
    {
        $images = $this->gallery->orderBy('id','DESC')->findAll();
---
SELECT *
FROM `gallery`
ORDER BY `id` DESC