app/Controllers/Booking.php

      public function index()
    {
        // ✅ Load system name + logo
        $system = (new SiteSystemModel())->find(1);
---
SELECT *
FROM `site_system`
WHERE `site_system`.`id` = 1

    public function services()
    {
        return $this->response->setJSON(
            (new ServiceModel())->where('status','active')->findAll()
        );
---
SELECT *
FROM `services`
WHERE `status` = 'active'

    public function barbers($serviceId)
{
    $date = $this->request->getGet('date'); // 👈 selected date

    $builder = (new BarberServiceModel())
        ->select('barbers.id, barbers.name')
        ->join('barbers', 'barbers.id = barber_services.barber_id')
        ->where('barber_services.service_id', $serviceId)
        ->where('barbers.status', 'active');

    /* 🚫 EXCLUDE BARBERS ON LEAVE */
    if ($date) {
        $builder->whereNotIn('barbers.id', function ($sub) use ($date) {
            return $sub->select('barber_id')
                ->from('barber_leaves')
                ->where('start_date <=', $date)
                ->where('end_date >=', $date);
        });
    }

    return $this->response->setJSON($builder->findAll());
---
SELECT `barbers`.`id`, `barbers`.`name`
FROM `barber_services`
JOIN `barbers` ON `barbers`.`id` = `barber_services`.`barber_id`
WHERE `barber_services`.`service_id` = '7'
AND `barbers`.`status` = 'active'
AND `barbers`.`id` NOT IN (SELECT `barber_id` FROM `barber_leaves` WHERE `start_date` <= '2026-01-31' AND `end_date` >= '2026-01-31')

public function slots()
{
    $serviceId = $this->request->getGet('service_id');
    $barberId  = $this->request->getGet('barber_id');
    $date      = $this->request->getGet('date');

    if (!$serviceId || !$barberId || !$date) {
        return $this->response->setJSON([]);
    }

    $serviceModel = new \App\Models\ServiceModel();
    $appointmentModel = new \App\Models\AppointmentModel();
    $settingModel = new \App\Models\SettingModel(); // ✅ new

    $service = $serviceModel->find($serviceId);
---
SELECT *
FROM `services`
WHERE `services`.`id` = '7'

public function confirm()
{
    $data = $this->request->getJSON(true);

    $serviceIds = $data['service_ids']; // ARRAY
    $startTime  = $data['time'];

    $serviceModel = new \App\Models\ServiceModel();
    $totalMinutes = 0;

    foreach ($serviceIds as $sid) {
        $service = $serviceModel->find($sid);
        if ($service) {
            $totalMinutes += (int)$service['duration_minutes']; // ✅ fixed
        }
    }

    $endTime = date(
        "H:i:s",
        strtotime("+{$totalMinutes} minutes", strtotime($startTime))
    );

    // Insert into appointments table
    $appointmentModel = new \App\Models\AppointmentModel();
    $appointmentId = $appointmentModel->insert([
        'customer_name' => $data['name'],
        'phone'         => $data['phone'],
        'email'         => $data['email'],
        'barber_id'     => $data['barber_id'],
        'date'          => $data['date'],
        'start_time'    => $startTime,
        'end_time'      => $endTime,
        'status'        => 'pending'
    ]);
---
SELECT *
FROM `services`
WHERE `services`.`id` = 7
INSERT INTO `appointments` (`customer_name`, `phone`, `email`, `barber_id`, `date`, `start_time`, `end_time`, `status`, `created_at`, `updated_at`) VALUES ('sasi', '0767861171', 'navodyaga2001@gmail.com', 11, '2026-01-31', '11:00', '13:00:00', 'pending', '2026-01-29 08:48:17', '2026-01-29 08:48:17')

    // Insert into appointment_services table
    $appointmentServiceModel = new \App\Models\AppointmentServiceModel();
    foreach ($serviceIds as $sid) {
        $appointmentServiceModel->insert([
            'appointment_id' => $appointmentId,
            'service_id'     => $sid
        ]);
---
INSERT INTO `appointment_services` (`appointment_id`, `service_id`) VALUES (30, 7)