app/Controllers/Home.php

SELECT *
FROM `site_system`
WHERE `site_system`.`id` = 1
---
    public function index()
    {
        $system = (new SiteSystemModel())->find(1);