app/Controllers/ServicesController.php

    public function index()
    {
        $data['services'] = $this->service
            ->where('status', 'active')
            ->orderBy('id', 'DESC')
            ->findAll();

        // Fetch system/site settings
        $data['system'] = $this->siteSystemModel->first();
---
SELECT *
FROM `services`
WHERE `status` = 'active'
ORDER BY `id` DESC
SELECT *
FROM `site_system`
 LIMIT 1