app/Models/SettingModel.php

SELECT *
FROM `settings`
WHERE `key` = 'full_day_closed'
AND   (
`date` = '2026-01-31'
OR date IS NULL
 )
ORDER BY `date` DESC
 LIMIT 1
---
    public function getValue($key, $date = null)
    {
        $builder = $this->where('key', $key);

        if ($date) {
            $builder->groupStart()
                    ->where('date', $date)
                    ->orWhere('date IS NULL', null, false)
                    ->groupEnd();
        }

        $setting = $builder->orderBy('date', 'DESC')->first();

SELECT *
FROM `settings`
ORDER BY `date` DESC
---
    public function allSettings()
    {
        return $this->orderBy('date', 'DESC')->findAll();